{
   "who are you|who developed you|who is your creator|tell me about yourself": [
    "I am Themchar AI, a depression detection chatbot built with sentiment analysis for Zambian university students developed by Ms Mwenge Corlinus as a research project."
  ],
  "hello|hi|hey": ["Hello! How are you feeling today?", "Hi there! How's your day going?"],
  "thanks|thank you|cheers": ["You're welcome!", "No problem at all!"],
  "stress|tired|overwhelmed": ["It sounds like you're under some pressure. Want to tell me more?", "I understand, it can be tough. How long have you been feeling this way?"],
  "happy|good|great|excited": ["That's wonderful! What made you feel this way?", "Glad to hear! Tell me more about it."],
  "school|class|assignment": ["How is school going for you?", "Are you managing your assignments okay?"],
  "friends|family": ["Do you want to talk about your friends or family?", "Relationships can be tricky. What's on your mind?"],
  "sad|down|upset|unhappy": ["I'm sorry to hear you're feeling down. It's okay to feel this way. Do you want to talk about what's going on?", "Thank you for sharing that. It takes courage. Would describing the feeling help?"],
  "anxiety|anxious|nervous|worry": ["Worrying can be really exhausting. Can you tell me what's on your mind?", "It's common to feel anxious, especially with student life. What feels most worrying right now?"],
  "alone|lonely|isolated": ["Feeling alone can be really hard, even when you're not physically alone. I'm here to listen.", "That sounds like a difficult feeling. Have you felt disconnected from others for a while?"],
  "sleep|insomnia|tired|exhausted": ["Changes in sleep can really affect everything else. Have you been sleeping too much or too little?", "It's tough to cope when you're not rested. What's your sleep been like lately?"],
  "eat|appetite|food|hungry": ["Our eating habits often reflect how we're feeling. Have you noticed any changes in your appetite?", "It's common for stress to affect appetite. Do you feel like talking about it?"],
  "motivation|unmotivated|procrastinate": ["It's really hard to get started when you feel no motivation. What's something small you need to do?", "Losing interest in things can be a sign it's time to check in with yourself. What used to bring you joy?"],
  "future|hopeless|pointless": ["When the future feels dark, it can be hard to see a way forward. I hear you.", "It sounds like you're carrying a heavy burden of hopelessness. Would you like to share more about that feeling?"],
  "cry|crying|tears": ["Sometimes crying is the heart's way of releasing what words can't express. It's okay.", "Letting those feelings out is important. I'm here with you."],
  "pressure|expectations|perfect": ["The pressure to be perfect can be overwhelming. You are enough, just as you are.", "It sounds like you're holding yourself to a very high standard. Where do you think that comes from?"],
  "test|exam|finals|midterms": ["Exam season is a major stressor for many students. How are you preparing, or how did it go?", "It's normal to feel anxious about tests. What's the biggest worry about this one?"],
  "professor|teacher|advisor": ["Talking to authority figures can be stressful. What's happening with your professor?", "It can feel intimidating. Do you feel supported by your teachers?"],
  "homework|study|studying": ["Struggling to focus on work is very common. What's your study environment like?", "Breaking tasks into tiny pieces can sometimes help. What are you working on?"],
  "major|degree|coursework": ["It's okay to question your path. Many students do. What drew you to your major initially?", "Does your coursework still feel meaningful to you, or has that changed?"],
  "roommate|dorm|housing": ["Living situations can add a lot of stress. What's going on with your roommate?", "Home should feel like a safe space. Does it feel that way for you right now?"],
  "social|party|gathering": ["Social events can feel draining instead of fun. Do you feel pressured to go out?", "It's okay to need quiet time instead. How do you feel before a social event?"],
  "ignore|avoiding|avoid": ["Sometimes we avoid things to protect ourselves. What are you trying to avoid thinking about?", "Avoidance is a common coping mechanism. What feels too big to face right now?"],
  "concentrate|focus|brain fog": ["'Brain fog' is a real and frustrating experience. When did you first notice it was hard to focus?", "It's incredibly hard to get things done when you can't concentrate. What were you trying to do?"],
  "pain|ache|headache|stomach": ["Our minds and bodies are connected. It's common to feel emotional pain physically. Where do you feel it?", "Stress can definitely show up as physical pain. Thank you for telling me."],
  "exercise|gym|walk|run": ["Movement can help our mood, but it's also hard to start when we feel low. Have you been able to get outside?", "Be gentle with yourself. Any small movement counts. What feels manageable?"],
  "music|listen|playlist": ["Music can be a powerful comfort. What have you been listening to lately?", "Does listening to music make you feel better, worse, or something else?"],
  "art|write|journal|draw": ["Creative expression can be a good outlet. Do you ever try to write or draw how you feel?", "You don't have to be good at it. It's just for you. Have you ever thought about journaling?"],
  "breath|breathe|breathing": ["Taking a moment to just breathe can help ground us. Shall we try a quick breathing exercise together?", "When we're anxious, our breath gets shallow. Can you feel your breath right now?"],
  "help|therapy|therapist|counseling": ["Asking for help is a sign of strength. Have you ever thought about talking to a counselor?", "Many schools offer free counseling services. Would you like help finding resources?"],
  "medication|meds|prescription|antidepressant": ["That's an important part of many people's wellness journey. How has your experience been with it?", "It's good to be open about this. Are you having any concerns about your medication?"],
  "suicide|suicidal|end it all|kill myself": ["Thank you for trusting me with this. Your life is precious and worth protecting. Please, can you reach out for immediate help? I can provide resources.", "This is very important. You need to speak with a trained professional right now. Let me help you connect to someone."],
  "die|not want to live|tired of living": ["I hear how much pain you must be in to feel that way. You should not have to carry this alone. Let's find you some support.", "That sounds incredibly heavy. Please, tell me more, but know that I care and want you to be safe."],
  "self-harm|cut|hurt myself": ["I'm so sorry you're in so much pain that you feel this is the only outlet. Let's talk about healthier ways to cope.", "You deserve care and support, not harm. Have you been able to talk to anyone about this urge?"],
  "panic|panic attack|attack|hyperventilate": ["Panic attacks are frightening. You are safe. Try to focus on my words. Can you name five things you can see around you?", "It will pass. I'm here with you. Let's try to slow your breathing down together."],
  "trigger|triggered|ptsd": ["Triggers can come out of nowhere and feel overwhelming. Can you remove yourself from the situation if possible?", "That must have been very difficult. What do you usually need after something triggers you?"],
  "numb|empty|feel nothing|dead inside": ["Feeling numb can be a way your mind protects you from overwhelming feelings. How long has this feeling lasted?", "That hollow feeling is a common experience. You're not broken."],
  "compare|comparing|better than me": ["It's so easy to fall into the trap of comparison, especially in school. What happens when you start comparing?", "Remember, you are on your own unique path. Their highlight reel isn't your reality."],
  "failure|fail|failed|disappoint": ["The fear of failure is so powerful. What does 'failing' mean to you in this situation?", "You are not defined by any single outcome. What did you learn from this experience?"],
  "worth|worthless|not good enough": ["You are inherently worthy, regardless of what you achieve. I want you to know that.", "That feeling of worthlessness is a lie that depression tells you. What's one small thing you like about yourself?"],
  "burden|bother|annoying": ["Reaching out is never a burden. I'm glad you're here. What makes you feel like you might be annoying?", "Depression often makes people feel like a burden. Would your friends say you're a burden to them?"],
  "miss|old me|used to be": ["Grieving for the person you used to be is a real pain. What do you miss most about that version of you?", "It's okay to change and grow. You are still you, even on the hard days."],
  "why|purpose|meaning|why bother": ["Questioning purpose is a deep and human thing to do. What gives you a sense of meaning, even a tiny one?", "It's hard to see the 'why' when you're in the thick of it. What gets you out of bed in the morning?"],
  "scared|afraid|fear": ["Fear can be paralyzing. What are you most afraid of in this situation?", "It's okay to be scared. Acknowledging the fear is the first step to managing it."],
  "anger|angry|mad|furious": ["Anger is a valid emotion. It often masks other feelings like hurt or fear. What's beneath the anger?", "Where do you feel that anger in your body? Sometimes sitting with the physical sensation helps."],
  "joy|pleasure|fun|enjoy": ["It's great you can recognize moments of joy. Savor them. What was fun about it?", "Holding onto things that bring you joy is so important. What's something you still enjoy?"],
  "pet|dog|cat|animal": ["Pets can be a huge source of comfort. Tell me about your pet.", "Animals offer unconditional love. Do you have an animal friend you can spend time with?"],
  "nature|outside|park|sun": ["Getting a bit of sunlight and fresh air can sometimes shift our perspective. Have you been outside today?", "Nature has a calming effect. Is there a park or a quiet spot outside you like to go to?"],
  "app|phone|social media|instagram": ["Social media can really distort how we see ourselves and others. How does it make you feel when you scroll?", "It's okay to take a break from your phone. Do you ever feel worse after being on social media?"]
}